
## Plan Result




<pre><code>Plan: 9 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;add-participant&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;delete-participant&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;edit-participant&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;add-participant&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;delete-participant&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;edit-participant&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;add-participant&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;delete-participant&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;edit-participant&#34;]
* Update
  * module.api_mgmt_product.azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["add-participant"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Add Participant"
      + display_name        = "Add Participant"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "add-participant"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/{hearingId}/participants"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Accept"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 200
        }

      + template_parameter {
          + name     = "hearingId"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["delete-participant"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Delete Participant"
      + display_name        = "Delete Participant"
      + id                  = (known after apply)
      + method              = "DELETE"
      + operation_id        = "delete-participant"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/{hearingId}/participants/{participantId}"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Accept"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 200
        }

      + template_parameter {
          + name     = "hearingId"
          + required = true
          + type     = "string"
        }
      + template_parameter {
          + name     = "participantId"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["edit-participant"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Edit Participant"
      + display_name        = "Edit Participant"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "edit-participant"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/{hearingId}/participants/{participantId}"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Accept"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 200
        }

      + template_parameter {
          + name     = "hearingId"
          + required = true
          + type     = "string"
        }
      + template_parameter {
          + name     = "participantId"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["add-participant"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "add-participant"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["delete-participant"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "delete-participant"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["edit-participant"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "edit-participant"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["add-participant"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "video-hearings"
      + id               = (known after apply)
      + name             = "video-hearings"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["delete-participant"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "video-hearings"
      + id               = (known after apply)
      + name             = "video-hearings"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["edit-participant"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "video-hearings"
      + id               = (known after apply)
      + name             = "video-hearings"
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":21,"Program":"tfcmt","SHA1":"","Vars":{}} -->